benchmarks/results/auth-serialization/test-ping/without-logging/wrk2-logs/run_1_1105_2007.txt
Running 30s test @ http://127.0.0.1:8000/ping
  2 threads and 10 connections
  Thread calibration: mean lat.: 2.488ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.465ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.26ms  783.48us   5.26ms   64.76%
    Req/Sec   526.93     90.85     0.89k    78.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.26ms
 75.000%    2.81ms
 90.000%    3.29ms
 99.000%    4.12ms
 99.900%    4.60ms
 99.990%    4.97ms
 99.999%    5.27ms
100.000%    5.27ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.609     0.000000            1         1.00
       1.192     0.100000         1998         1.11
       1.506     0.200000         4003         1.25
       1.774     0.300000         5993         1.43
       2.012     0.400000         7990         1.67
       2.257     0.500000         9991         2.00
       2.361     0.550000        10999         2.22
       2.465     0.600000        11991         2.50
       2.581     0.650000        13002         2.86
       2.693     0.700000        13985         3.33
       2.813     0.750000        14988         4.00
       2.877     0.775000        15493         4.44
       2.945     0.800000        15996         5.00
       3.011     0.825000        16480         5.71
       3.089     0.850000        16987         6.67
       3.185     0.875000        17481         8.00
       3.229     0.887500        17729         8.89
       3.287     0.900000        17982        10.00
       3.341     0.912500        18234        11.43
       3.407     0.925000        18476        13.33
       3.489     0.937500        18726        16.00
       3.529     0.943750        18851        17.78
       3.575     0.950000        18976        20.00
       3.631     0.956250        19104        22.86
       3.691     0.962500        19226        26.67
       3.761     0.968750        19353        32.00
       3.795     0.971875        19416        35.56
       3.827     0.975000        19476        40.00
       3.885     0.978125        19539        45.71
       3.937     0.981250        19601        53.33
       3.991     0.984375        19663        64.00
       4.023     0.985938        19695        71.11
       4.059     0.987500        19725        80.00
       4.091     0.989062        19757        91.43
       4.139     0.990625        19789       106.67
       4.175     0.992188        19819       128.00
       4.191     0.992969        19834       142.22
       4.231     0.993750        19850       160.00
       4.255     0.994531        19865       182.86
       4.299     0.995313        19882       213.33
       4.331     0.996094        19896       256.00
       4.355     0.996484        19905       284.44
       4.399     0.996875        19913       320.00
       4.423     0.997266        19920       365.71
       4.459     0.997656        19929       426.67
       4.487     0.998047        19936       512.00
       4.495     0.998242        19939       568.89
       4.507     0.998437        19943       640.00
       4.535     0.998633        19947       731.43
       4.591     0.998828        19951       853.33
       4.611     0.999023        19956      1024.00
       4.619     0.999121        19958      1137.78
       4.631     0.999219        19959      1280.00
       4.667     0.999316        19961      1462.86
       4.703     0.999414        19963      1706.67
       4.751     0.999512        19965      2048.00
       4.783     0.999561        19966      2275.56
       4.815     0.999609        19967      2560.00
       4.819     0.999658        19968      2925.71
       4.847     0.999707        19969      3413.33
       4.879     0.999756        19970      4096.00
       4.879     0.999780        19970      4551.11
       4.899     0.999805        19971      5120.00
       4.899     0.999829        19971      5851.43
       4.971     0.999854        19972      6826.67
       4.971     0.999878        19972      8192.00
       4.971     0.999890        19972      9102.22
       4.979     0.999902        19973     10240.00
       4.979     0.999915        19973     11702.86
       4.979     0.999927        19973     13653.33
       4.979     0.999939        19973     16384.00
       4.979     0.999945        19973     18204.44
       5.267     0.999951        19974     20480.00
       5.267     1.000000        19974          inf
#[Mean    =        2.256, StdDeviation   =        0.783]
#[Max     =        5.264, Total count    =        19974]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29994 requests in 30.00s, 3.86MB read
Requests/sec:    999.74
Transfer/sec:    131.80KB