benchmarks/results/auth-serialization/test-ping/without-logging/wrk2-logs/run_2_1105_2007.txt
Running 30s test @ http://127.0.0.1:8000/ping
  2 threads and 10 connections
  Thread calibration: mean lat.: 2.653ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.742ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.57ms    2.54ms  80.77ms   99.72%
    Req/Sec   526.86     96.69     1.22k    79.44%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.42ms
 75.000%    2.88ms
 90.000%    3.27ms
 99.000%    3.89ms
 99.900%   54.85ms
 99.990%   78.85ms
 99.999%   80.83ms
100.000%   80.83ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.695     0.000000            1         1.00
       1.759     0.100000         2000         1.11
       1.986     0.200000         3999         1.25
       2.151     0.300000         5999         1.43
       2.287     0.400000         7991         1.67
       2.423     0.500000         9988         2.00
       2.497     0.550000        11015         2.22
       2.577     0.600000        12002         2.50
       2.657     0.650000        12985         2.86
       2.761     0.700000        13998         3.33
       2.875     0.750000        14986         4.00
       2.931     0.775000        15489         4.44
       2.989     0.800000        15981         5.00
       3.057     0.825000        16493         5.71
       3.121     0.850000        16978         6.67
       3.187     0.875000        17480         8.00
       3.233     0.887500        17738         8.89
       3.269     0.900000        17986        10.00
       3.309     0.912500        18239        11.43
       3.351     0.925000        18481        13.33
       3.395     0.937500        18729        16.00
       3.425     0.943750        18856        17.78
       3.455     0.950000        18980        20.00
       3.495     0.956250        19101        22.86
       3.535     0.962500        19227        26.67
       3.577     0.968750        19354        32.00
       3.603     0.971875        19415        35.56
       3.629     0.975000        19475        40.00
       3.659     0.978125        19539        45.71
       3.693     0.981250        19601        53.33
       3.743     0.984375        19663        64.00
       3.783     0.985938        19696        71.11
       3.821     0.987500        19727        80.00
       3.861     0.989062        19756        91.43
       3.919     0.990625        19789       106.67
       3.979     0.992188        19818       128.00
       4.007     0.992969        19834       142.22
       4.037     0.993750        19850       160.00
       4.085     0.994531        19865       182.86
       4.143     0.995313        19881       213.33
       4.235     0.996094        19896       256.00
       4.303     0.996484        19904       284.44
       4.451     0.996875        19912       320.00
       8.351     0.997266        19920       365.71
      19.119     0.997656        19928       426.67
      28.863     0.998047        19935       512.00
      35.199     0.998242        19939       568.89
      38.079     0.998437        19943       640.00
      44.191     0.998633        19947       731.43
      49.343     0.998828        19951       853.33
      55.007     0.999023        19955      1024.00
      58.559     0.999121        19957      1137.78
      60.543     0.999219        19959      1280.00
      62.047     0.999316        19961      1462.86
      65.919     0.999414        19963      1706.67
      68.543     0.999512        19965      2048.00
      68.799     0.999561        19966      2275.56
      72.447     0.999609        19967      2560.00
      73.215     0.999658        19968      2925.71
      74.367     0.999707        19969      3413.33
      75.071     0.999756        19970      4096.00
      75.071     0.999780        19970      4551.11
      75.327     0.999805        19971      5120.00
      75.327     0.999829        19971      5851.43
      78.847     0.999854        19972      6826.67
      78.847     0.999878        19972      8192.00
      78.847     0.999890        19972      9102.22
      79.615     0.999902        19973     10240.00
      79.615     0.999915        19973     11702.86
      79.615     0.999927        19973     13653.33
      79.615     0.999939        19973     16384.00
      79.615     0.999945        19973     18204.44
      80.831     0.999951        19974     20480.00
      80.831     1.000000        19974          inf
#[Mean    =        2.572, StdDeviation   =        2.540]
#[Max     =       80.768, Total count    =        19974]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29994 requests in 30.00s, 3.86MB read
Requests/sec:    999.72
Transfer/sec:    131.80KB