benchmarks/results/auth-serialization/test-ping/without-logging/wrk2-logs/run_3_1105_2008.txt
Running 30s test @ http://127.0.0.1:8000/ping
  2 threads and 10 connections
  Thread calibration: mean lat.: 2.546ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.209ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.78ms    4.62ms  80.58ms   99.07%
    Req/Sec   526.58     94.61     1.22k    80.81%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.39ms
 75.000%    3.04ms
 90.000%    3.51ms
 99.000%    4.72ms
 99.900%   73.66ms
 99.990%   79.61ms
 99.999%   80.64ms
100.000%   80.64ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.621     0.000000            1         1.00
       1.271     0.100000         2000         1.11
       1.632     0.200000         4001         1.25
       1.888     0.300000         5999         1.43
       2.131     0.400000         7997         1.67
       2.393     0.500000         9989         2.00
       2.529     0.550000        10996         2.22
       2.655     0.600000        11994         2.50
       2.787     0.650000        12986         2.86
       2.911     0.700000        13983         3.33
       3.037     0.750000        14994         4.00
       3.101     0.775000        15496         4.44
       3.173     0.800000        15991         5.00
       3.241     0.825000        16489         5.71
       3.317     0.850000        16985         6.67
       3.405     0.875000        17488         8.00
       3.459     0.887500        17730         8.89
       3.509     0.900000        17981        10.00
       3.573     0.912500        18231        11.43
       3.637     0.925000        18481        13.33
       3.715     0.937500        18727        16.00
       3.757     0.943750        18851        17.78
       3.813     0.950000        18981        20.00
       3.859     0.956250        19102        22.86
       3.919     0.962500        19225        26.67
       3.981     0.968750        19350        32.00
       4.035     0.971875        19413        35.56
       4.073     0.975000        19475        40.00
       4.143     0.978125        19539        45.71
       4.219     0.981250        19600        53.33
       4.311     0.984375        19664        64.00
       4.371     0.985938        19694        71.11
       4.455     0.987500        19726        80.00
       4.611     0.989062        19756        91.43
       6.963     0.990625        19787       106.67
      19.279     0.992188        19818       128.00
      25.711     0.992969        19834       142.22
      33.215     0.993750        19850       160.00
      39.071     0.994531        19865       182.86
      45.727     0.995313        19881       213.33
      50.463     0.996094        19896       256.00
      53.567     0.996484        19904       284.44
      57.151     0.996875        19912       320.00
      59.743     0.997266        19920       365.71
      63.359     0.997656        19928       426.67
      64.767     0.998047        19935       512.00
      67.583     0.998242        19939       568.89
      68.735     0.998437        19943       640.00
      70.207     0.998633        19947       731.43
      72.127     0.998828        19951       853.33
      74.239     0.999023        19955      1024.00
      74.431     0.999121        19957      1137.78
      75.199     0.999219        19959      1280.00
      75.455     0.999316        19961      1462.86
      75.647     0.999414        19963      1706.67
      75.839     0.999512        19965      2048.00
      76.799     0.999561        19966      2275.56
      78.783     0.999609        19967      2560.00
      79.103     0.999658        19968      2925.71
      79.167     0.999707        19969      3413.33
      79.423     0.999756        19970      4096.00
      79.423     0.999780        19970      4551.11
      79.615     0.999805        19972      5120.00
      79.615     0.999829        19972      5851.43
      79.615     0.999854        19972      6826.67
      79.615     0.999878        19972      8192.00
      79.615     0.999890        19972      9102.22
      79.871     0.999902        19973     10240.00
      79.871     0.999915        19973     11702.86
      79.871     0.999927        19973     13653.33
      79.871     0.999939        19973     16384.00
      79.871     0.999945        19973     18204.44
      80.639     0.999951        19974     20480.00
      80.639     1.000000        19974          inf
#[Mean    =        2.785, StdDeviation   =        4.615]
#[Max     =       80.576, Total count    =        19974]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29994 requests in 30.00s, 3.86MB read
Requests/sec:    999.71
Transfer/sec:    131.80KB